01_viv/02-viv-tandem-crossflow/cylinderAndBackground/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


libs            (overset fvMotionSolvers);

application     overPimpleDyMFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         100;

deltaT          0.005;

writeControl    timeStep;

writeInterval   20;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           0.9;

/*
functions
{
    forces1
    {
        type            forces;
        libs            (forces);
        patches         (cylinder);
        rhoInf          998.8;
        log             on;
	rho		998.8;
        writeControl    timeStep;
        writeInterval   1;
        CofR            (0 0 0);
    }

forces2
    {
        type            forces;
        libs            (forces);
        patches         (cylinder2);
        rho             998.8;
        log             on;
        writeControl    timeStep;
        writeInterval   1;
        CofR            (1.5 0 0);
    }
}
*/

// ************************************************************************* //
