01_viv/02-viv-tandem-crossflow/cylinderAndBackground/0_orig/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

flowVelocity         (1 0 0);
pressure             0;
turbulentKE          1.5;
turbulentEpsilon     0.88;

// ************************************************************************* //
