01_viv/02-viv-tandem-crossflow/cylinderAndBackground/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c0;
        type    cellSet;
        action  new;
        source  regionToCell;
        insidePoints ((-4.999 0 -3.999));
    }

    {
        name    c1;
        type    cellSet;
        action  new;
        source  cellToCell;
        set     c0;
    }

    {
        name    c1;
        type    cellSet;
        action  invert;
    }

   {
        name    c2;
        type    cellSet;
        action  new;
        source  regionsToCell;
        set     c1;
        insidePoints
        (
            (0.31 0.0 -1.1)
        );
    }

    {
        name    c1;
        type    cellSet;
        action  subtract;
        source  cellToCell;
        set     c2;
    }

    
);

// ************************************************************************* //
